Repository: yamarten/atproto-website
Catalog: translation/omegat/project_save.tmx
Source language: en_us
Languages: ja

source: (contains embedded content)
ja: （埋め込みコンテンツあり）

source: (no email)
ja: （メールがありません）

source: * **ID provision.** Users should be able to create global IDs which are stable across services. These IDs should never change, to ensure that links to their content are stable. * **Public key distribution.** Distributed systems rely on cryptography to prove the authenticity of data. The identity system must publish their public keys with strong security. * **Key rotation.** Users must be able to rotate their key material without disrupting their identity. * **Service discovery.** Applications must be able to discover the services in use by a given user. * **Usability.** Users should have human-readable and memorable names. * **Portability.** Identities should be portable across services. Changing a provider should not cause a user to lose their identity, social graph, or content.
ja: * **IDプロビジョニング**。ユーザーは、サービス間で安定したグローバルIDを作成できる必要があります。これらのIDは、コンテンツへのリンクが安定していることを保証するために、ほとんど変更されない必要があります。 * **公開鍵の配布**。分散システムは、データの信頼性を証明し、エンドツーエンドのプライバシーを提供するために暗号化に依存しています。IDシステムは、強力なセキュリティで公開鍵を公開する必要があります。 * **鍵のローテーション**。ユーザーは、IDを中断することなく鍵マテリアルをローテーションできる必要があります。 * **サービスの検出**。ユーザーと対話するには、アプリケーションは、特定のユーザーが使用しているサービスを検出できる必要があります。 * **使いやすさ**。ユーザーの名前は、人間が読みやすく、覚えやすいものにする必要があります。 * **移植性**。IDはサービス間で移植可能である必要があります。プロバイダーを変更しても、ユーザーがID、ソーシャルグラフ、またはコンテンツを失うことはありません。

source: * **Signing key**: Validates the user's data repository. All DIDs include such a key. * **Rotation keys**: Asserts changes to the DID Document itself. The PLC DID method includes this, while the DID Web method does not.
ja: * **署名鍵**：ユーザーのデータリポジトリを検証します。全てのDIDに含まれています。 * **ローテーション鍵**：DIDドキュメントへの変更をアサートします。PLC DIDメソッドにはありますが、DID Webメソッドにはありません。

source: **Authentication is the first part of our docs for a reason!** You don't always need to be authenticated to [read data](/reading-data#unauthenticated-reads) from AT Protocol records or even to [stream data from the firehose](/guides/streaming-data). But if you're looking to build an application that integrates with the Atmosphere of ATProto apps in some way, you'll begin with authentication. You might start out by just using AT Protocol identities as an OAuth source — though you'll find that there's lots more you can do by building on top of the ATProto [social graph](/guides/social-graph).
ja: **認証が最初のドキュメントであることには理由があります**。ATプロトコルのレコードから[データを読む](/reading-data#unauthenticated-reads)ために常に認証が必要というわけではありませんし、[firehoseからデータをストリーム](/guides/streaming-data)する場合も同じです。ただしATプロトコルアプリの環境（Atmosphere）に何らかの形で統合されるアプリケーションを構築したい場合は、認証から始めることになります。まずATプロトコルのIDをOAuthソースとして使うだけから始めるかもしれませんが、ATプロトコルの[ソーシャルグラフ](/guides/social-graph)上でさらに多くのことができることに気付くでしょう。

source: **Authorization is the first part of our docs for a reason!** You don't always need to be authenticated to [read data](/reading-data#unauthenticated-reads) from AT Protocol records or even to [stream data from the firehose](/guides/streaming-data). But if you're looking to build an application that integrates with the Atmosphere of Atproto apps in some way, you'll begin with authentication. You might start out by just using AT Protocol identities as an OAuth source — though you'll find that there's lots more you can do by building on top of the Atproto [social graph](/guides/social-graph).
ja: **認可が最初のドキュメントであることには理由があります**。ATプロトコルのレコードから[データを読む](/reading-data#unauthenticated-reads)ために常に認証・認可が必要というわけではありませんし、[firehoseからデータをストリーム](/guides/streaming-data)する場合も同じです。ただしatprotoアプリの環境（Atmosphere）に何らかの形で統合されるアプリケーションを構築したい場合は、認可から始めることになります。まずATプロトコルのIDをOAuthソースとして使うだけから始めるかもしれませんが、atprotoの[ソーシャルグラフ](/guides/social-graph)上でさらに多くのことができることに気付くでしょう。

source: **CBOR Record Size:** try to keep individual records to a few dozen KBytes. If you need to store more data, even text data, consider using a blob instead. A reasonable maximum record size limit (`MAX_CBOR_RECORD_SIZE`) is 1 MiByte (1 mebibyte, or 1,048,576 bytes). Note that as of August 2025, the `subscribeRepos` Lexicon limits `#commit` message block size to 2,000,000 bytes (not mebibytes), so only a single 1 MiByte record can be created or updated per commit.
ja: **CBORレコードサイズ：**個別のレコードを数十キロバイト程度に抑えるようにしてください。テキストデータを含め、より大きなデータを保存する必要がある場合は、代わりにblobの使用を検討してください。合理的な最大レコードサイズ制限（`MAX_CBOR_RECORD_SIZE`）は1 MiByte（1メビバイト、または1,048,576バイト）です。2025年8月の時点では、`subscribeRepos`のLexiconは`#commit`メッセージブロックサイズを2,000,000バイト（メビバイトではない）に制限しているため、コミットごとに1 MiByteレコードは1つだけ作成または更新できます。

source: **CID binary encoding size:** recommend an overall limit (`MAX_CID_BYTES`) of 100 bytes.
ja: **CIDバイナリエンコーディングサイズ：**全体で100バイトの制限（`MAX_CID_BYTES`）を推奨します。

source: **Client IDs**: In other OAuth ecosystems, it is often necessary for client apps to pre-register themselves with the resource server. This is not viable in a decentralized system (with many clients and many resource servers), so ATProto addresses this using [Client ID Metadata Documents](/specs/oauth#client-id-metadata-document).
ja: **クライアントID**： 他のOAuthエコシステムでは、クライアントアプリケーションがリソースサーバーに事前登録が必要なことがよくあります。これは分散型システム（多数のクライアントと多数のリソースサーバーがある）では実行できないため、ATプロトコルは[Client ID Metadata Documents](/specs/oauth#client-id-metadata-document)を使用してこれに対処しています。

source: **Container element count:** for example, how many keys in a map, or elements in an array. If your CBOR or JSON parsing library supports a limit, the default is probably fine. A reasonable limit (`MAX_CBOR_CONTAINER_LEN`) is 128 x 1024 = 131,072 elements.
ja: **コンテナ要素数：**例えば、マップ内のキーの数、または配列内の要素の数。CBORまたはJSONパースライブラリが制限をサポートしている場合、おそらくデフォルトで問題ありません。合理的な制限（`MAX_CBOR_CONTAINER_LEN`）は128 x 1024 = 131,072要素です。

source: **Container nesting depth:** for example, how many layers of map inside an array inside an array, etc. If your CBOR or JSON parsing library supports a limit, the default is probably fine. A reasonable limit (`MAX_CBOR_NESTED_LEVELS`) is 32 levels of nesting.
ja: **コンテナネストの深さ：**例えば、配列内の配列内のマップが何層あるかなど。CBORまたはJSONパースライブラリが制限をサポートしている場合、おそらくデフォルトで問題ありません。合理的な制限（`MAX_CBOR_NESTED_LEVELS`）は32レベルのネストです。

source: **General `bytes` length:** same as the string limit, but for binary data (`MAX_RECORD_BYTES_LEN`). Recommend relying on the overall CBOR record size limit. As with record size overall, if more than a few dozen KBytes are needed, recommendation is to use blobs.
ja: **一般的な`bytes`長：**文字列制限と同じですが、バイナリデータ（`MAX_RECORD_BYTES_LEN`）の場合。CBORレコード全体のサイズ制限に従うことをお勧めします。レコードサイズと同様に、数十キロバイト以上が必要な場合、推奨はblobを使用することです。

source: **General string length:** an overall length limit on strings within a record, including both those with and without Lexicon-specified string lengths. Measured as bytes (UTF-8 encoded). Should try to keep these to tens of KBytes at most. For an upper-bound limit (`MAX_RECORD_STRING_LEN`), reasonable to just rely on the overall CBOR record size limit. Notably, some early implementations had a 8 KByte (8192 bytes) limit.
ja: **一般的な文字列長：**Lexiconによる文字列長指定の有無を問わない、レコード内の文字列全般に対する長さ制限。バイト（UTF-8エンコード）で測定されます。これらは最大でも数十キロバイト程度に保つようにしてください。上限（`MAX_RECORD_STRING_LEN`）については、全体的なCBORレコードサイズ制限に従うのが妥当でしょう。なお、初期の一部実装では8キロバイト（8192バイト）の制限を持っていました。

source: **Integers:** as mentioned [in the atproto specification](https://atproto.com/specs/data-model#data-types), it is a strongly recommended best practice to keep integer values "64-bit float safe", meaning restricting them to 53 bits of precision. This ensures compatibility with JavaScript without loss of numeric precision. The specific values are `MAX_SAFE_INTEGER: 9007199254740991` and `MIN_SAFE_INTEGER: -9007199254740991`.
ja: **整数：**[atproto仕様](https://atproto.com/specs/data-model#data-types)で述べられているように、整数値を"64ビットフロートセーフ"に保つこと、つまり53ビットの精度に制限することは強く推奨されるベストプラクティスです。これにより、精度の損失なくJavaScriptとの互換性が保証されます。具体的な値としては`MAX_SAFE_INTEGER: 9007199254740991`および`MIN_SAFE_INTEGER: -9007199254740991`です。

source: **JSON Record Size:** the CBOR encoding is "canonical" for records, so focusing only on that encoding would make sense. But sometimes it is good to also have a limit on JSON encoding size. A reasonable limit (`MAX_JSON_RECORD_SIZE`) is 2 MiByte (2,097,152 bytes).
ja: **JSONレコードサイズ：**CBORエンコーディングはレコードの正規形であるため、そのエンコーディングのみに焦点を当てることは理にかなっています。ただし、JSONエンコーディングのサイズに制限を設けることが良い場合もあります。合理的な制限（`MAX_JSON_RECORD_SIZE`）は2 MiByte（2,097,152バイト）です。

source: **Labels** are a form of metadata about any account or content in the AT ecosystem. Labels are published by *moderation services*, which are either hardcoded into the application or chosen by the user. They are attached to records in the responses under the `labels` key.
ja: **ラベル**は、ATエコシステム内のアカウントまたはコンテンツに関するメタデータ形式です。ラベルは*モデレーションサービス*によって公開され、アプリケーションにハードコードされているか、ユーザーによって選択されます。これらはレスポンスの`labels`フィールドでレコードに付与されます。

source: **Lexicons provide Interoperability.** AT applications need a way to declare their own behaviors and semantics. Lexicon solves this while making it straightforward for developers to introduce new schemas.
ja: **Lexiconは相互運用性を提供します**。ATアプリケーションには、各自の振る舞いとセマンティクスを宣言する方法が必要です。Lexiconはこれを解決しながら、開発者が新しいスキーマを導入するのを簡単にします。

source: **Migration**: ATProto users can migrate their accounts between servers ([PDSes](/guides/glossary#pds-personal-data-server)) over time. To facilitate this ATProto has a flexible [Identity](/guides/identity) layer, which allows usernames ([handles](/specs/handle)) to be resolved to a static user ID ([DID](/specs/did)), which in turn can be resolved to locate the user's PDS. When a user logs in to an app, the OAuth client dynamically resolves these relationships.
ja: **移行**：ATプロトコルユーザーはアカウントをサーバー（[PDS](/guides/glossary#pds-personal-data-server)）間で移行できます。これを促進するため、ATプロトコルは柔軟な[ID](/guides/identity)レイヤーを持っており、ユーザー名（[ハンドル](/specs/handle)）を不変のユーザーID（[DID](/specs/did)）に解決でき、さらにそれを解決してユーザーのPDSを見つけることができます。ユーザーがアプリケーションにログインすると、OAuthクライアントはこれらの関係を動的に解決します。

source: **Object key string length:** for example, how many bytes (UTF-8 encoded) are allowed in any key of an object. If your CBOR or JSON parsing library supports a limit, the default is probably fine. A reasonable limit (`MAX_CBOR_OBJECT_KEY_LEN`) is 8 KByte (8192).
ja: **オブジェクトキー文字列長：**例えば、オブジェクトのキーで許可されるバイト数（UTF-8エンコード）。CBORまたはJSONパーシングライブラリが制限をサポートしている場合、おそらくデフォルトで問題ありません。合理的な制限（`MAX_CBOR_OBJECT_KEY_LEN`）は8キロバイト（8192）です。

source: **Relays** handle all of your events, like retrieving large-scale metrics (likes, reposts, followers), content discovery (algorithms), and user search.
ja: **リレー**は広域的な指標（いいね数、リポスト数、フォロワー数）の取得、コンテンツ発見（アルゴリズム）、ユーザー検索など、すべてのイベントを処理します。

source: **Relays** handle all of your events, like retrieving large-scale metrics (likes, reposts, followers), content discovery (algorithms), and user search. The Relay also handles [rate limiting](https://docs.bsky.app/docs/advanced-guides/rate-limits) of individual PDSes to ensure that content can be indexed from across the network.
ja: **リレー**は広域的な指標（いいね数、リポスト数、フォロワー数）の取得、コンテンツ発見（アルゴリズム）、ユーザー検索など、すべてのイベントを処理します。リレーは個々のPDSの[レート制限](https://docs.bsky.app/docs/advanced-guides/rate-limits)も処理し、ネットワーク全体からコンテンツをインデックスできるようにします。

source: **To install Ozone**, refer to <a href="https://github.com/bluesky-social/ozone/blob/main/HOSTING.md" target="_blank">HOSTING.md</a> in the <a href="https://github.com/bluesky-social/ozone" target="_blank">Ozone GitHub repository</a>.
ja: **Ozoneをインストールする**には、<a href="https://github.com/bluesky-social/ozone" target="_blank">Ozone GitHubリポジトリ</a>の<a href="https://github.com/bluesky-social/ozone/blob/main/HOSTING.md" target="_blank">HOSTING.md</a>を参照してください。

source: **To install Ozone**, refer to [HOSTING.md](https://github.com/bluesky-social/ozone/blob/main/HOSTING.md) in the [Ozone GitHub repository](https://github.com/bluesky-social/ozone).
ja: **Ozoneをインストールする**には、[Ozone GitHubリポジトリ](https://github.com/bluesky-social/ozone)の[HOSTING.md](https://github.com/bluesky-social/ozone/blob/main/HOSTING.md)を参照してください。

source: *This post is a blogpost version of a [recent talk](https://www.youtube.com/watch?v=1A-0k58TfPo) that Daniel Holmgren gave at AtmosphereConf (March 2025).*
ja: *この投稿は、Daniel HolmgrenがAtmosphereConf（2025年3月）で行った[講演](https://www.youtube.com/watch?v=1A-0k58TfPo)のブログ版です。*

source: - **ATProto is distributed**: Usually, when an app has a "sign in with..." button, it provides a choice of which authorities it allows to authenticate users (usually one of a few big corporations). With ATProto OAuth, the app has no prior relationship with the authentication provider: a user's [PDS](/guides/the-at-stack#pds). This is also the reason why ATProto OAuth is not compatible with OIDC, which requires a pre-established relationship.
ja: - **ATプロトコルは分散しています**：通常、アプリに「…でサインイン」ボタンがある場合、ユーザーの認証を許可する権限を選択できます（大抵は少数の大企業のどれか）。ATプロトコルのOAuthでは、アプリは認証プロバイダー、つまりユーザーの[PDS](/guides/the-at-stack#pds)との事前の関係がありません。これは、ATプロトコルのOAuthが、事前に確立された関係を必要とするOIDCと互換性がない理由でもあります。

source: - **Atproto is distributed**: Usually, when an app has a "sign in with..." button, it provides a choice of which authorities it allows to authenticate users (usually one of a few big corporations). With ATProto OAuth, the app has no prior relationship with the authentication provider: a user's [PDS](/guides/the-at-stack#pds). This is also the reason why Atproto OAuth is not compatible with OIDC, which requires a pre-established relationship.
ja: - **atprotoは分散しています**：通常、アプリに「…でサインイン」ボタンがある場合、ユーザーの認証を許可する権限を選択できます（大抵は少数の大企業のどれか）。atprotoのOAuthでは、アプリは認証プロバイダー、つまりユーザーの[PDS](/guides/the-at-stack#pds)との事前の関係がありません。これは、atprotoのOAuthが、事前に確立された関係を必要とするOIDCと互換性がない理由でもあります。

source: - **Client IDs**: In other OAuth ecosystems, it is often necessary for client apps to pre-register themselves with the resource server. This is not viable in a decentralized system (with many clients and many resource servers), so ATProto addresses this using [Client ID Metadata Documents](/specs/oauth#client-id-metadata-document).
ja: - **クライアントID**： 他のOAuthエコシステムでは、クライアントアプリケーションがリソースサーバーに事前登録が必要なことがよくあります。これは分散型システム（多数のクライアントと多数のリソースサーバーがある）では実行できないため、ATプロトコルは[Client ID Metadata Documents](/specs/oauth#client-id-metadata-document)を使用してこれに対処しています。

source: - **Client IDs**: In other OAuth ecosystems, it is often necessary for client apps to pre-register themselves with the resource server. This is not viable in a decentralized system (with many clients and many resource servers), so Atproto addresses this using [Client ID Metadata Documents](/specs/oauth#client-id-metadata-document).
ja: - **クライアントID**： 他のOAuthエコシステムでは、クライアントアプリケーションがリソースサーバーに事前登録が必要なことがよくあります。これは分散型システム（多数のクライアントと多数のリソースサーバーがある）では実行できないため、atprotoは[Client ID Metadata Documents](/specs/oauth#client-id-metadata-document)を使用してこれに対処しています。

source: - **Migration**: ATProto users can migrate their accounts between servers ([PDSes](/guides/glossary#pds-personal-data-server)) over time. To facilitate this ATProto has a flexible [Identity](/guides/identity) layer, which allows usernames ([handles](/specs/handle)) to be resolved to a static user ID ([DID](/specs/did)), which in turn can be resolved to locate the user's PDS. When a user logs in to an app, the OAuth client dynamically resolves these relationships.
ja: - **移行**：ATプロトコルユーザーはアカウントをサーバー（[PDS](/guides/glossary#pds-personal-data-server)）間で移行できます。これを促進するため、ATプロトコルは柔軟な[ID](/guides/identity)レイヤーを持っており、ユーザー名（[ハンドル](/specs/handle)）を不変のユーザーID（[DID](/specs/did)）に解決でき、さらにそれを解決してユーザーのPDSを見つけることができます。ユーザーがアプリケーションにログインすると、OAuthクライアントはこれらの関係を動的に解決します。

source: - **Migration**: Atproto users can migrate their accounts between servers ([PDSes](/guides/glossary#pds-personal-data-server)) over time. To facilitate this Atproto has a flexible [Identity](/guides/identity) layer, which allows usernames ([handles](/specs/handle)) to be resolved to a static user ID ([DID](/specs/did)), which in turn can be resolved to locate the user's PDS. When a user logs in to an app, the OAuth client dynamically resolves these relationships.
ja: - **移行**：ATプロトコルユーザーはアカウントをサーバー（[PDS](/guides/glossary#pds-personal-data-server)）間で移行できます。これを促進するため、ATプロトコルは柔軟な[ID](/guides/identity)レイヤーを持っており、ユーザー名（[ハンドル](/specs/handle)）を不変のユーザーID（[DID](/specs/did)）に解決でき、さらにそれを解決してユーザーのPDSを見つけることができます。ユーザーがアプリケーションにログインすると、OAuthクライアントはこれらの関係を動的に解決します。

source: - **Personal Data Servers (PDS).** They host user accounts. - **Relays**. They collect and rebroadcast user write events. - **Applications**. They aggregate user data to produce app experiences. - **Labelers**. Publish moderation decisions as label metadata.
ja: - **パーソナルデータサーバー（PDS）**：ユーザーアカウントをホストします。 - **リレー**：ユーザーの書き込みイベントを収集して再配信します。 - **アプリケーション**：ユーザーデータを集約してアプリ体験を作ります。 - **ラベラー**：モデレーションの判断をラベルメタデータとして公開します。

source: - **Records**. JSON, categorized into collections. - **Blobs**. The [images and videos](/guides/images-and-video). - **Lexicon**. The schema language. - **Lexicon RPC (XRPC).** It's HTTPS but with the routes defined by Lexicons.
ja: - **レコード**：コレクションごとに分類されたJSON。 - **blob**：[画像と動画](/guides/images-and-video)。 - **Lexicon**：スキーマ言語。 - **Lexicon RPC (XRPC)**：HTTPSですが、ルートはLexiconで定義されます。

source: - **Strong consistency.** For a given DID, a resolution query should produce only one valid document at any time. (In some networks, this may be subject to probabilistic transaction finality.) - **High availability**. Resolution queries must succeed reliably. - **Online API**. Clients must be able to publish new DID documents through a standard API. - **Secure**. The network must protect against attacks from its operators, a Man-in-the-Middle, and other users. - **Low cost**. Creating and updating DID documents must be affordable to services and users. - **Key rotation**. Users must be able to rotate keypairs without losing their identity. - **Decentralized governance**. The network should not be governed by a single stakeholder; it must be an open network or a consortium of providers.
ja: - **強い一貫性**。特定のDIDに対して、解決クエリによって生成される有効なドキュメントは常に1つだけである必要があります。（一部のネットワークでは、これは確率的なトランザクションの最終性に左右される可能性があります。） - **高可用性**。解決クエリは確実に成功する必要があります。 - **オンラインAPI**。クライアントは、標準APIを介して新しいDIDドキュメントを公開できる必要があります。 - **安全**。ネットワークは、オペレーター、MITM、およびその他のユーザーからの攻撃から保護する必要があります。 - **低コスト**。DIDドキュメントの作成と更新は、サービスとユーザーにとって手頃な価格である必要があります。 - **鍵ローテーション**。ユーザーは、IDを失うことなく鍵ペアをローテーションできる必要があります。 - **分散型ガバナンス**。ネットワークは単一の利害関係者によって管理されるべきではなく、オープンネットワークまたはプロバイダーのコンソーシアムである必要があります。

source: - **User repos.** The public per-user databases. - **User handles.** Usernames, which are DNS records. Our account is [@atproto.com](https://bsky.app/profile/atproto.com). - **User DIDs.** The permanent IDs of users.
ja: - **ユーザーリポジトリ**：ユーザーごとの公開データベース。 - **ユーザーハンドル**：DNSレコードとして表現されるユーザー名。私たちのアカウントは[@atproto.com](https://bsky.app/profile/atproto.com)です。 - **ユーザーDID**：ユーザーの恒久的なID。

source: - **repo** The [DID](https://atproto.com/specs/did) which identifies the user, - **collection** The collection name, and - **rkey** The record key
ja: - **repo** ユーザーを識別する[DID](https://atproto.com/specs/did) - **collection** コレクション名 - **rkey** レコードキー

source: - A community feed: Compile a list of DIDs within that community and filter the firehose for all posts from users within that list. - A topical feed: Filter the algorithm for posts and pass the post text through some filtering mechanism (an LLM, a keyword matcher, etc.) that filters for the topic of your choice. - [graze.social](https://www.graze.social/) provides an application model for AT Proto feeds. - You can find other examples of community-created feeds at [https://bsky.app/feeds](https://bsky.app/feeds).
ja: - コミュニティフィード：そのコミュニティ内のDIDのリストをコンパイルし、そのリスト内のユーザーからのすべての投稿についてfirehoseをフィルタリングします。 - トピックフィード：アルゴリズムが返す投稿に対して、投稿本文をフィルタリングメカニズム（LLM、キーワードマッチャーなど）に渡して、選択したトピック用にフィルタリングします。 - [graze.social](https://www.graze.social/)はATプロトコルフィードのアプリケーションモデルを提供します。 - コミュニティが作成したその他のフィード例は[https://bsky.app/feeds](https://bsky.app/feeds)で見つけることができます。

source: - A community feed: Compile a list of DIDs within that community and filter the firehose for all posts from users within that list. - A topical feed: Filter the algorithm for posts and pass the post text through some filtering mechanism (an LLM, a keyword matcher, etc.) that filters for the topic of your choice. - [graze.social](https://www.graze.social/) provides an application model for Atproto feeds. - You can find other examples of community-created feeds at [https://bsky.app/feeds](https://bsky.app/feeds).
ja: - コミュニティフィード：そのコミュニティ内のDIDのリストをコンパイルし、そのリスト内のユーザーからのすべての投稿についてfirehoseをフィルタリングします。 - トピックフィード：アルゴリズムが返す投稿に対して、投稿本文をフィルタリングメカニズム（LLM、キーワードマッチャーなど）に渡して、選択したトピック用にフィルタリングします。 - [graze.social](https://www.graze.social/)はatprotoフィードのアプリケーションモデルを提供します。 - コミュニティが作成したその他のフィード例は[https://bsky.app/feeds](https://bsky.app/feeds)で見つけることができます。

source: - A user requests a feed from the AppView using the at-uri of the declared feed - The AppView resolves the at-uri and finds the DID doc of the Feed Generator - The AppView sends a getFeedSkeleton request to the service endpoint declared in the Feed Generator's DID doc - This request is authenticated by a JWT signed by the user's repo signing key - The Feed Generator returns a skeleton of the feed to the AppView - The AppView hydrates the feed (user info, post contents, aggregates, etc.) - The AppView returns the hydrated feed to the user
ja: - 宣言されたフィードのat-uriを使用してユーザーがAppViewからフィードをリクエストします - AppViewがat-uriを解決し、フィードジェネレーターのDIDドキュメントを見つけます - AppViewがフィードジェネレーターのDIDドキュメントで宣言されたサービスエンドポイントにgetFeedSkeletonリクエストを送信します - このリクエストはユーザーのリポジトリ署名キーで署名されたJWTで認証されます - フィードジェネレーターがフィードのスケルトンをAppViewに返します。 - AppViewがフィードをハイドレート（ユーザー情報、投稿内容、集計値などの注入）します - AppViewがハイドレートされたフィードをユーザーに返します

source: - A user requests a feed from the application backend (e.g. Bluesky) - The application finds the DID doc of the requested feed to look up its hosting server - The application sends a `getFeedSkeleton` request to the hosting server - The feed's hosting server returns a list of post URLs - The application hydrates the feed (user info, post contents, aggregates, etc.) - The application returns the hydrated feed to the user
ja: - ユーザーがアプリケーションバックエンド（例：Bluesky）にフィードを要求する - アプリケーションが要求されたフィードのDIDドキュメントを見つけ、ホスティングサーバーを特定する - アプリケーションがホスティングサーバーへ`getFeedSkeleton`リクエストを送る - フィードのホスティングサーバーが投稿URLの一覧を返す - アプリケーションがフィードをハイドレート（ユーザー情報、投稿内容、集計情報などを付加）する - アプリケーションがハイドレート済みフィードをユーザーに返す

source: - Add a description to every `main` schema definition (records, API endpoints, etc) - for API endpoints, mention in the description if authentication is required, and whether responses will be personalized if authentication is optional - Add descriptions to potentially ambiguous fields and properties. This is particularly important for fields with generic names like `uri` or `cid`: CID of what?
ja: - すべての`main`スキーマ定義（レコード、APIエンドポイントなど）にdescriptionを追加してください - APIエンドポイントの場合、descriptionに認証が必須かどうか、認証がオプションの場合にレスポンスがパーソナライズされるかどうかを記載してください - 曖昧性のあるフィールドとプロパティにdescriptionを追加してください。これは`uri`や`cid`のような一般的な名前を持つフィールドに特に重要です（何のCIDですか？）。

source: - Change the PLC entries for *each* of your hosted accounts. You can use community-maintained interfaces like [boat](https://boat.kelinci.net/plc-applicator) for this. - Update your DNS configuration as you would for any other server, then change the domain name in `pds.env`.
ja: - ホストしている*各*アカウントのPLCエントリを変更してください。[boat](https://boat.kelinci.net/plc-applicator)のようなコミュニティ製のインターフェースを利用できます。 - 他のサーバーでやるようにDNS設定を更新し、その後`pds.env`内のドメイン名を変更してください。

source: - Design the [Lexicon](#) schemas for the records you'll publish into the Atmosphere. - Create a database for aggregating the records into useful views. - Build your application to write the records on your users' repos. - Listen to the firehose to aggregate data across the network.
ja: - Atmosphereに公開するレコードの[Lexicon](#)スキーマを設計します。 - レコードを便利なビューに集約するためのデータベースを作成します。 - ユーザーのリポジトリにレコードを書き込むアプリケーションを構築します。 - ネットワーク全体のデータを集約するために、firehoseをリッスンします。
